{
	"HomePage": {
		"title": "Ola Munthe Vassbotn",
		"subtitle": "Studerer Bachelor i informatikk ved NTNU"
	},
	"Experience": {
		"title": "Erfaring",
		"0": {
			"title": "Fag- og kurskomiteen, Linjeforeningen Online",
			"hasDescription": "true",
			"description": "Nestleder 24/25"
		},
		"1": {
			"title": "UI-test Utvikler hos Tana",
			"hasDescription": "true",
			"description": "Implementerte automatiserte UI-tester ved bruk av Cypress"
		},
		"2": {
			"title": "Sommerjobb hos Vitalthings",
			"hasDescription": "true",
			"description": "Arbeidet p친 frontenden og backenden til somnofy web appen."
		},
		"3": {
			"title": "HTML",
			"hasDescription": "false"
		},
		"4": {
			"title": "CSS",
			"hasDescription": "false"
		},
		"5": {
			"title": "JavaScript",
			"hasDescription": "false"
		},
		"6": {
			"title": "TypeScript",
			"hasDescription": "false"
		},
		"7": {
			"title": "Java",
			"hasDescription": "false"
		},
		"8": {
			"title": "Python",
			"hasDescription": "false"
		},
		"9": {
			"title": "React",
			"hasDescription": "false"
		},
		"10": {
			"title": "Next.js",
			"hasDescription": "false"
		},
		"11": {
			"title": "Tailwind CSS",
			"hasDescription": "false"
		}
	},
	"NavItems": {
		"home": "Hjem",
		"about-me": "Om Meg",
		"projects": "Prosjekter",
		"experience": "Erfaring",
		"themes": "Temaer",
		"contribute": "Interessert i 친 l칝re hvordan nettsiden er satt sammen?",

		"search-field": "S칮k..",

		"languageToggle": "Bytt Spr친k til Engelsk",
		"lightModeToggle": "Bytt til Lyst Tema",
		"darkModeToggle": "Bytt til M칮rkt Tema",
		"turnOnDevMode": "Skru p친 Utviklermodus",
		"turnOffDevMode": "Skru av Utviklermodus",

		"navigation": "Navigasjon",
		"socials": "Sosiale Medier",
		"settings": "Innstillinger",

		"wordle": "Wordle"
	},
	"About Me": {
		"title": "Om Meg",
		"sections": [
			{
				"title": "Hvem jeg er",
				"content": "Jeg er 21 친r gammel og studerer Informatikk ved NTNU, der jeg er i det tredje og siste 친ret av bachelorgraden min, men jeg har planer om 친 ta mastergrad etter bacheloren. Jeg er medlem av Fag- og Kurskomit칠en ved linjeforeningen Online, hvor jeg er nestleder for skole친ret 24/25."
			},
			{
				"title": "Mine ferdigheter",
				"content": "Jeg har erfaring med de fleste moderne webutviklingsteknologier, b친de frontend og backend. Jeg har ogs친 jobbet med Java for et par forskjellige prosjekter. Jeg l칝rer og tar imot ting raskt og jeg er alltid klar for 친 l칝re mer!"
			},
			{
				"title": "Min reise",
				"content": "Jeg startet min reise innen informatikk i 2020, da jeg tok noen IT1 og IT2 p친 videreg친ende skole. Etter det startet jeg min Bachelor i Informatikk ved NTNU Trondheim og har siden den gang l칝rt mye om programmering, webutvikling og programvareutvikling. Jeg har jobbet p친 flere prosjekter, b친de alene og i grupper, og har f친tt mye erfaring i feltet gjennom min sommerjobb i 2024."
			},
			{
				"title": "Mine m친l",
				"content": "Mitt m친l er 친 bli en utvikler. Jeg 칮nsker 친 jobbe med prosjekter som gj칮r en forskjell, og som kan hjelpe folk i deres hverdag. Jeg er veldig opptatt av teknologi, og jeg er alltid p친 jakt etter nye utfordringer og muligheter til 친 l칝re og vokse."
			}
		],
		"projectsbutton": "Mine Prosjekter",
		"experiencebutton": "Min Erfaring"
	},
	"Themes": {
		"title": "Fargetema for Denne Nettsiden"
	},
	"Projects": {
		"title": "Prosjekter",
		"playSnake": "SPILL SNAKE",
		"playWordle": "SPILL WORDLE",
		"projects": [
			{
				"title": "Nettside laget med React, TypeScript, Next.js og Tailwind CSS",
				"description": "Dette prosjektet er faktisk denne nettsiden! Den ble laget med React, TypeScript, Next.js og Tailwind CSS. Jeg bygde den for 친 vise frem arbeidet mitt og for 친 gi informasjon om meg selv til potensielle arbeidsgivere og samarbeidspartnere."
			},
			{
				"title": "Wordle-klone",
				"wordleGame": "true"
			},
			{
				"title": "Snake-spill med React",
				"snakeGame": "true"
			},
			{
				"title": "Quizlet-klone med React, TypeScript, Next.js og Mantine",
				"description": "Dette prosjektet ble laget i et team i kurset TDT4140 Programvareutvikling. Det er en klone av den popul칝re flashcard-appen Quizlet, og ble laget med React, TypeScript, Next.js og Mantine. Appen lar brukere opprette, dele og studere flashcards, og inkluderer funksjoner som quiz-modus, s칮kefunksjon og m칮rk modus.",
				"githubLink": "Sjekk ut prosjektet her!",
				"projectID": "flashy"
			},
			{
				"title": "Hotellbestillingsapp med Java, JavaFX, Maven og Springboot",
				"description": "Denne appen ble laget i et team i kurset IT1901 Informatikk Prosjekt I. Det er en hotellbestillingsapp som lar brukere s칮ke etter og bestille hotellrom. Appen ble laget med Java, JavaFX, Maven og Springboot, og inkluderer funksjoner som s칮kefunksjon, bookingsystem og en bruker 'database' (selv om den databasen bare var noen f친 JSON-filer游삒). Dette ble laget veldig tidlig i b친de min og teamets karriere. Det var en flott l칝ringsopplevelse, og jeg fikk mye verdifull erfaring innen programvareutvikling, teamarbeid og prosjektledelse.",
				"githubLink": "Sjekk ut appen her!",
				"projectID": "gr2313"
			}
		]
	},
	"DevMode": {
		"accessDenied": "Ingen adgang. Vennligst skru p친 utviklermodus for 친 se denne siden."
	}
}
