{
	"HomePage": {
		"title": "Ola Munthe Vassbotn",
		"subtitle": "Studerer Bachelor i informatikk ved NTNU"
	},
	"Experience": {
		"title": "Erfaring",
		"0": {
			"title": "Fag- og kurskomiteen, Linjeforeningen Online",
			"hasDescription": "true",
			"description": "Nestleder 24/25"
		},
		"1": {
			"title": "UI-test Utvikler hos Tana",
			"hasDescription": "true",
			"description": "Implementerte automatiserte UI-tester ved bruk av Cypress"
		},
		"2": {
			"title": "HTML",
			"hasDescription": "false"
		},
		"3": {
			"title": "CSS",
			"hasDescription": "false"
		},
		"4": {
			"title": "JavaScript",
			"hasDescription": "false"
		},
		"5": {
			"title": "TypeScript",
			"hasDescription": "false"
		},
		"6": {
			"title": "Java",
			"hasDescription": "false"
		},
		"7": {
			"title": "Python",
			"hasDescription": "false"
		},
		"8": {
			"title": "React",
			"hasDescription": "false"
		},
		"9": {
			"title": "Next.js",
			"hasDescription": "false"
		}
	},
	"NavItems": {
		"home": "Hjem",
		"about-me": "Om Meg",
		"projects": "Prosjekter",
		"experience": "Erfaring",
		"themes": "Temaer",
		"contribute": "Interessert i 친 l칝re hvordan nettsiden er satt sammen?",

		"search-field": "S칮k..",

		"languageToggle": "Bytt Spr친k til Engelsk",
		"lightModeToggle": "Bytt til Lyst Tema",
		"darkModeToggle": "Bytt til M칮rkt Tema",
		"turnOnDevMode": "Skru p친 Utviklermodus",
		"turnOffDevMode": "Skru av Utviklermodus",

		"navigationTitle": "Navigasjon",
		"socialsTitle": "Sosiale Medier",
		"settingsTitle": "Innstillinger"
	},
	"About Me": {
		"title": "Om Meg",
		"sections": [
			{
				"title": "Hvem Jeg Er",
				"content": "Jeg er en 20 친r gammel Informatikk student ved NTNU, og jeg er i det 2. 친ret i bacheloren min. Jeg er medlem av Fag- og Kurskomiteen i Linjeforeningen Online, hvor jeg er nestleder for skole친ret 24/25."
			},
			{
				"title": "Mine Ferdigheter",
				"content": "Jeg designet denne nettsiden i React med TypeScript, og benyttet rammeverk som Next.js for server-side rendering og SEO-fordeler. Mitt verkt칮ysett inkluderer Material UI for 친 designe responsive og tema-konsistente brukergrensesnitt, sammen med en solid grunnlag i HTML, CSS, og JavaScript. I tillegg har jeg erfaring med Java og Python, og har jobbet p친 prosjekt i begge spr친kene. Jeg ser alltid etter nye muligheter til 친 utvide mine ferdigheter og l칝re nye teknologier."
			},
			{
				"title": "Min Reise",
				"content": "Jeg startet min reise med informatikk i 2020, da jeg tok noen IT1 og IT2 p친 videreg친ende skole. Etter det begynte jeg p친 Bachelor i Informatikk ved NTNU Trondheim og har siden da l칝rt mye om programmering, webutvikling, og programvareutvikling. Jeg har jobbet p친 flere prosjekt, b친de alene og i grupper, og har f친tt mye relevant erfaring."
			},
			{
				"title": "Mine M친l",
				"content": "M친let mitt er 친 bli en full-stack utvikler. Jeg 칮nsker 친 jobbe med prosjekter som gj칮r en forskjell, og som kan hjelpe folk i deres hverdagsliv. Jeg er lidenskapelig opptatt av teknologi, og jeg ser alltid etter nye utfordringer og muligheter for 친 l칝re."
			}
		],
		"projectsbutton": "Mine Prosjekter",
		"experiencebutton": "Min Erfaring"
	},
	"Themes": {
		"title": "Fargetema for Denne Nettsiden"
	},
	"Projects": {
		"title": "Prosjekter",
		"projects": [
			{
				"title": "Nettside bygget med React, TypeScript, Next.js, og Material UI",
				"description": "Dette prosjektet er faktisk denne nettsiden! Den ble bygget med React, TypeScript, Next.js og Material UI. Den er en responsiv og tema-konsistent nettside som viser mine ferdigheter, erfaringer og prosjekter. Den er designet for 친 v칝re enkel 친 navigere og visuelt tiltalende. Jeg bygde denne nettsiden for 친 vise frem arbeidet mitt og for 친 gi informasjon om meg selv til potensielle arbeidsgivere og samarbeidspartnere. Hvis du har noen tilbakemeldinger eller forslag, ikke n칮l med 친 kontakte meg! 游땕"
			},
			{
				"title": "Snake-spill i React",
				"description": "Et Canvas Snake-spill bygget med React og TypeScript. Alle de typiske snake-funksjonene er inkludert. Om du 칮nsker 친 pr칮ve det ut, skriv inn konami-koden 游땔",
				"mobileDescription": "Et Canvas Snake-spill bygget med React og TypeScript. Alle de typiske snake-funksjonene er inkludert."
			},
			{
				"title": "Quizlet-klone med React, TypeScript, Next.js og Mantine",
				"description": "Dette prosjektet ble bygget i et team i sammenheng med faget TDT4140 Programvareutvikling. Det er en klone av den popul칝re flashcard-appen Quizlet, og ble bygget med React, TypeScript, Next.js og Mantine. Appen lar brukere opprette, dele og studere flashcards, og inkluderer funksjoner som en quizmodus, en s칮kefunksjon og en m칮rk modus. Appen er responsiv og visuelt tiltalende, og ble designet med brukervennlighet og tilgjengelighet i tankene. Prosjektet var en flott l칝ringsopplevelse, og jeg fikk mye verdifull erfaring i programvareutvkling, teamarbeid og prosjektledelse.",
				"githubLink": "Se p친 prosjektet her!",
				"projectID": "flashy"
			},
			{
				"title": "Hotellbooking app med Java, JavaFX, Maven og Springboot",
				"description": "Denne appen ble bygget i et team i sammenheng med faget IT1901 Informatikk prosjektarbeid I. Det er en hotellbooking app som lar brukere s칮ke etter og bestille hotellrom. Appen ble bygget med Java, JavaFX, Maven og Springboot, og inkluderer funksjoner som en s칮kefunksjon, et bestillingssystem og en bruker 'database' (selv om den databasen bare var et par JSON-filer游삒). Appen er relativt visuelt tiltalende og enkel 친 bruke, men dette ble bygget veldig tidlig ute i b친de min og mitt teams karriere. Prosjektet var en flott l칝ringsopplevelse, og jeg fikk mye verdifull erfaring i programvareteknikk, teamarbeid og prosjektledelse.",
				"githubLink": "Se p친 appen her!",
				"projectID": "gr2313"
			}
		]
	},
	"DevMode": {
		"accessDenied": "Ingen adgang. Vennligst skru p친 utviklermodus for 친 se denne siden."
	}
}
