{
	"HomePage": {
		"title": "Ola Munthe Vassbotn",
		"subtitle": "Bachelor i informatikk ved NTNU",
		"experienceTitle": "Erfaring:"
	},
	"experience": {
		"0": {
			"title": "Fag- og kurskomiteen, Linjeforeningen Online",
			"hasDescription": "true",
			"description": "Nestleder 24/25"
		},
		"1": {
			"title": "Java",
			"hasDescription": "false"
		},
		"2": {
			"title": "Python",
			"hasDescription": "false"
		},
		"3": {
			"title": "React",
			"hasDescription": "false"
		},
		"4": {
			"title": "Next.js",
			"hasDescription": "false"
		}
	},
	"NavDrawer": {
		"home": "Hjem",
		"projects": "Prosjekt",
		"about-me": "Om Meg",
		"themes": "Temaer"
	},
	"About Me": {
		"title": "Om Meg",
		"sections": [
			{
				"title": "Hvem Jeg Er",
				"content": "Jeg er en 20 år gammel Informatikk student ved NTNU, og jeg er i det 2. året i bacheloren min. Jeg er medlem av Fag- og Kurskomiteen i Linjeforeningen Online, hvor jeg er nestleder for skoleåret 24/25."
			},
			{
				"title": "Mine Ferdigheter",
				"content": "Jeg designet denne nettsiden i React med TypeScript, og benyttet rammeverk som Next.js for server-side rendering og SEO-fordeler. Mitt verktøysett inkluderer Material UI for å designe responsive og tema-konsistente brukergrensesnitt, sammen med en solid grunnlag i HTML, CSS, og JavaScript. I tillegg har jeg erfaring med Java og Python, og har jobbet på prosjekt i begge språkene. Jeg ser alltid etter nye muligheter til å utvide mine ferdigheter og lære nye teknologier."
			},
			{
				"title": "Min Reise",
				"content": "Jeg startet min reise med informatikk i 2020, da jeg tok noen IT1 og IT2 på videregående skole. Etter det begynte jeg på Bachelor i Informatikk ved NTNU Trondheim og har siden da lært mye om programmering, webutvikling, og programvareutvikling. Jeg har jobbet på flere prosjekt, både alene og i grupper, og har fått mye relevant erfaring."
			},
			{
				"title": "Mine Mål",
				"content": "Mitt mål er å bli en full-stack utvikler. Jeg ønsker å jobbe med prosjekter som gjør en forskjell, og som kan hjelpe folk i deres hverdagsliv. Jeg er lidenskapelig opptatt av teknologi, og jeg ser alltid etter nye utfordringer og muligheter for å lære."
			}
		]
	},
	"Themes": {
		"title": "Fargetema for Denne Nettsiden"
	},
	"Projects": {
		"title": "WIP: Prosjekter",
		"projects": [
			{
				"title": "Prosjekt 1",
				"description": "Beskrivelse"
			},
			{
				"title": "Prosjekt 2",
				"description": "Beskrivelse"
			},
			{
				"title": "Prosjekt 3",
				"description": "Beskrivelse"
			}
		]
	}
}
