{
	"HomePage": {
		"title": "Ola Munthe Vassbotn",
		"subtitle": "Bachelor of Informatics at NTNU",
		"experienceTitle": "Experience:"
	},
	"experience": {
		"0": {
			"title": "Academic Courses Comittee, Student Organization Online",
			"hasDescription": "true",
			"description": "Deputy Head 24/25"
		},
		"1": {
			"title": "Java",
			"hasDescription": "false"
		},
		"2": {
			"title": "Python",
			"hasDescription": "false"
		},
		"3": {
			"title": "React",
			"hasDescription": "false"
		},
		"4": {
			"title": "Next.js",
			"hasDescription": "false"
		}
	},
	"NavDrawer": {
		"home": "Home",
		"projects": "Projects",
		"about-me": "About Me",
		"themes": "Themes"
	},
	"About Me": {
		"title": "About Me",
		"sections": [
			{
				"title": "Who I Am",
				"content": "I am a 20 year old Informatics student at NTNU, and i'm in the 2nd year of my bachelor's degree. I am a member of the Academic Courses Comittee at the Student Organization Online, where I am the deputy head for the school year 24/25."
			},
			{
				"title": "My Skills",
				"content": "I specialize in React with TypeScript, leveraging frameworks like Next.js for server-side rendering and SEO benefits. My toolset includes Material UI for designing responsive and theme-consistent UIs, along with a strong foundation in HTML, CSS, and JavaScript."
			},
			{
				"title": "My Journey",
				"content": "I started my journey in informatics in 2019, and have since then learned a lot about programming, web development, and software engineering. I have worked on several projects, both alone and in groups, and have gained a lot of experience in the field."
			},
			{
				"title": "My Goals",
				"content": "My goal is to become a full-stack developer, with a strong focus on front-end development. I want to work on projects that make a difference, and that can help people in their everyday lives. I am passionate about technology, and I am always looking for new challenges and opportunities to learn and grow."
			}
		]
	},
	"Themes": {
		"title": "Color Theme for This Website"
	}
}
