{
	"HomePage": {
		"title": "Ola Munthe Vassbotn",
		"subtitle": "Studying Bachelor of Informatics at NTNU"
	},
	"Experience": {
		"title": "Experience",
		"0": {
			"title": "Academic Courses Comittee, Student Organization Online",
			"hasDescription": "true",
			"description": "Deputy Head 24/25"
		},
		"1": {
			"title": "UI-test Engineer at Tana",
			"hasDescription": "true",
			"description": "Implemented automated UI tests using Cypress"
		},
		"2": {
			"title": "Summer Intern at Vitalthings",
			"hasDescription": "true",
			"description": "Worked on frontend and backend of the somnofy web app."
		},
		"3": {
			"title": "HTML",
			"hasDescription": "false"
		},
		"4": {
			"title": "CSS",
			"hasDescription": "false"
		},
		"5": {
			"title": "JavaScript",
			"hasDescription": "false"
		},
		"6": {
			"title": "TypeScript",
			"hasDescription": "false"
		},
		"7": {
			"title": "Java",
			"hasDescription": "false"
		},
		"8": {
			"title": "Python",
			"hasDescription": "false"
		},
		"9": {
			"title": "React",
			"hasDescription": "false"
		},
		"10": {
			"title": "Next.js",
			"hasDescription": "false"
		},
		"11": {
			"title": "Tailwind CSS",
			"hasDescription": "false"
		}
	},
	"NavItems": {
		"home": "Home",
		"about-me": "About Me",
		"projects": "Projects",
		"experience": "Experience",
		"themes": "Themes",
		"contribute": "Interested in learning how the website is put together?",

		"search-field": "Search..",

		"languageToggle": "Change language to Norwegian",
		"lightModeToggle": "Change to light mode",
		"darkModeToggle": "Change to dark mode",
		"turnOnDevMode": "Turn on developer mode",
		"turnOffDevMode": "Turn off developer mode",

		"navigationTitle": "Navigation",
		"socialsTitle": "Socials",
		"settingsTitle": "Settings",

		"wordle": "Wordle"
	},
	"About Me": {
		"title": "About Me",
		"sections": [
			{
				"title": "Who I Am",
				"content": "I am a 20 year old Informatics student at NTNU, and i'm in the 2nd year of my bachelor's degree. I am a member of the Academic Courses Comittee at the Student Organization Online, where I am the deputy head for the school year 24/25."
			},
			{
				"title": "My Skills",
				"content": "I designed this website in React with TypeScript, leveraging frameworks like Next.js for server-side rendering and SEO benefits. My toolset includes Material UI for designing responsive and theme-consistent UIs, along with a strong foundation in HTML, CSS, and JavaScript. Additionally, I have experience with Java and Python, and have worked on projects in both languages. I am always looking to expand my skillset and learn new technologies."
			},
			{
				"title": "My Journey",
				"content": "I started my journey in informatics in 2020, when I took some introductory programming classes in High School. After that, I started my Bachelor of Informatics at NTNU Trondheim and have since then learned a lot about programming, web development, and software engineering. I have worked on several projects, both alone and in groups, and have gained a lot of experience in the field."
			},
			{
				"title": "My Goals",
				"content": "My goal is to become a full-stack developer. I want to work on projects that make a difference, and that can help people in their everyday lives. I am passionate about technology, and I am always looking for new challenges and opportunities to learn and grow."
			}
		],
		"projectsbutton": "My Projects",
		"experiencebutton": "My Experience"
	},
	"Themes": {
		"title": "Color Theme for This Website"
	},
	"Projects": {
		"title": "Projects",
		"playSnake": "PLAY SNAKE",
		"projects": [
			{
				"title": "Website built with React, TypeScript, Next.js, and Material UI",
				"description": "This project is actually this website! It was built with React, TypeScript, Next.js, and Material UI. It is a responsive and theme-consistent website that showcases my skills, experience, and projects. It is designed to be easy to navigate and visually appealing. I built this website to showcase my work and to provide information about myself to potential employers and collaborators. If you have any feedback or suggestions, feel free to reach out to me! 😊"
			},
			{
				"title": "Snake Game with React",
				"description": "A Canvas Snake Game built with React and TypeScript. All the typical snake features are included. If you want to try it out, input the konami code 😉",
				"mobileDescription": "A Canvas Snake Game built with React and TypeScript. All the typical snake features are included."
			},
			{
				"title": "Quizlet clone with React, TypeScript, Next.js, and Mantine",
				"description": "This project was built in a team in the course TDT4140 Software Engineering. It is a clone of the popular flashcard app Quizlet, and was built with React, TypeScript, Next.js, and Mantine. The app allows users to create, share, and study flashcards, and includes features like a quiz mode, a search function, and a dark mode. The app is responsive and visually appealing, and was designed with usability and accessibility in mind. The project was a great learning experience, and I gained a lot of valuable experience in software engineering, teamwork, and project management.",
				"githubLink": "Check out the project here!",
				"projectID": "flashy"
			},
			{
				"title": "Hotel Booking app with Java, JavaFX, Maven, and Springboot",
				"description": "This app was built in a team in the course IT1901 Informatics Project I. It is a hotel booking app that allows users to search for and book hotel rooms. The app was built with Java, JavaFX, Maven, and Springboot, and includes features like a search function, a booking system, and a user 'database' (even if that database was just a couple JSON files🫣). The app is relatively visually appealing and easy to use, but this was built very early on in both mine and my team's careers. The project was a great learning experience, and I gained a lot of valuable experience in software engineering, teamwork, and project management.",
				"githubLink": "Check out the app here!",
				"projectID": "gr2313"
			}
		]
	},
	"DevMode": {
		"accessDenied": "Access denied. Please enable developer mode to access this page."
	}
}
